from typing import Final


QUARTER: Final[str] = "24_3"

COLORS = {
    "Отменена": "#d5d8dc",  # серый, светлее
    #
    "Новая": "#d98880",  # красный-розовый
    "В работе": "#f0b27a",  # оранжевый
    "На проверке и доработке": "#f7dc6f",  # желтый
    "Ожидает релиз, проверена": "#82e0aa",  # зеленый
    "Выполнена": "#aeb6bf",  # серый, темнее
    #
    "Ожидание": "#bfc9ca",  # коричневый
    "Ожидание разработки": "#bfc9ca",  # коричневый
}

PRIORITY = {1: "Низкий", 2: "Нормальный", 3: "Высокий", 4: "Срочный", 5: "Немедленный"}

GROUP_MAP = {None: 1, "": 1, "4. План": 5, "3. Критический функционал": 4, "2. Доп. функционал": 3, "1. Доработки": 2}

QUARTER_MAP = {"23_3": 9, "23_4": 8, "24_1": 7, "24_2": 6, "24_3": 5, "24_4": 4, "25_1": 3, "25_2": 2, None: 1, "": 1}
